print("==========================================")
name = input("ชื่อผู้สมัคร : ")
age = int(input("อายุ : "))
height = int(input("ส่วนสูง : "))
power = int(input("พละกำลัง (1-10) : "))
money = float(input("เงินติดตัว : "))


if (name == "Nebula" or name == "nebula"):
    print("ผลการประเมิน: ผ่าน ")
    print("ตำแหน่ง: เด็กเส้นนี่หว่า")
elif money >= 500000:
    print("ผลการประเมิน: ผ่าน ")
    print("ตำแหน่ง: นายทุนใหญ่ ไม่ต้องทำอะไรเลย แค่เอาตังค์มาให้ก็พอ")
elif (age >= 60):
        print("ผลการประเมิน: ไม่ผ่าน ")
        print("อายุเยอะแล้วไปพักผ่อนไป")
elif (age < 18):
        print("ผลการประเมิน: ไม่ผ่าน ")
        print("อายุน้อยไปหางานทำเถาะ")
elif (age < 60 and age > 18 and power > 7):
    print("ผลการประเมิน: ผ่าน ")
    print("ตำแหน่ง: แรงงาน ใช้ร่างกายให้เป็นประโยชน์ซะ")
else:
    print("ผลการประเมิน: ไม่ผ่าน")

print("==========================================")